## Анализ А/В-теста для интернет-магазина
Тест проводился на двух группах покупателей магазина, необходимо было принять решение о продолжении теста или его остановке. 
На этапе предобработки данных обнаружили серьезную ошибку: некоторые пользователи попали в обе группы, что серьезно могло исказить результаты нашего исследования. 
Провели четыре статистических теста, используя U-критерий Манна — Уитни. Сравнили статистическую значимость конверсий и среднего чека между двумя группами по «сырым» и «очищенным» данным (без аномальных пользователей и заказов). Пришли к выводу, что тест можно останавливать: вторая группа значительно превосходит первую по всем показателям. Предложили исправить ошибку с пользователями и заново проверить результаты теста.

